function check() {
    var a = [6, 28, 496, 8128, 33550336, 8589869056, 137438691328, 2305843008139952128, 2658455991569831744654692615953842176, 191561942608236107294793378084303638130997321548169216];
    var c = 0;
    var b = parseInt(prompt("¬ведите число"));
    for (var i = 0; i < a.length; i++) {
        while (isNaN(b)) {
            b = parseInt(prompt("¬ведите число заново"))
        }
        if (b == a[i]) {
            alert("¬веденное число €вл€етс€ совершенным");
            c += 1;
        }
    }
    if (c == 0) {
        alert("¬веденное число не €вл€етс€ совершенным")
    }
}